# Вывести кубы первых n чисел, где n вводит пользователь.

for n in range(3):
    p = int(input("Введите число: "))
    k = p ** 3
    print(k)
